/**
 * Created by Megic
 */

module.exports = {
    cPhone: function (phone) {//检验是否是手机号码
        var phoneOne = {
            //中国移动
            cm: /^(?:0?1)((?:3[56789]|5[0124789]|8[278])\d|34[0-8]|47\d)\d{7}$/,
            //中国联通
            cu: /^(?:0?1)(?:3[012]|4[5]|5[356]|8[356]\d|349)\d{7}$/,
            //中国电信
            ce: /^(?:0?1)(?:33|53|8[079])\d{8}$/,
            //中国大陆
            cn: /^(?:0?1)[3458]\d{9}$/
            //中国香港
            //   hk: /^(?:0?[1569])(?:\d{7}|\d{8}|\d{12})$/,
            //澳门
            // macao: /^6\d{7}$/,
            //台湾
            //  tw: /^(?:0?[679])(?:\d{7}|\d{8}|\d{10})$//*,
            //韩国
            //  kr:/^(?:0?[17])(?:\d{9}|\d{8})$/,
            //日本
            // jp:/^(?:0?[789])(?:\d{9}|\d{8})$/*/
        };
        var ok=0;
        for (var i in phoneOne) {
            if (phoneOne[i].test(phone)) {
                ok = 1;
                break
            }
        }
        return ok;
    }
};